driver-tests/pojose/wikiSamples/05_POJO2BPEL_CBR/caWWOrderRouterStatic/test/testAsia/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:caw="caWWOrderRouterStatic">
  <soapenv:Body>
    <caw:WWOrderRouterStaticOperation>
      <part1><wwd:order xmlns:wwd="wwOrderProcessNS">
      <fulfillmentLocation>Asia</fulfillmentLocation>
      <orderPayload>Payload for Asia fulfillment center.</orderPayload>
    </wwd:order></part1>
    </caw:WWOrderRouterStaticOperation>
  </soapenv:Body>
</soapenv:Envelope>
